        >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. Lab3.
AUTHOR. John Stephen Johnson.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
        SELECT PeopleLab3 ASSIGN TO "PeopleLab3.dat"
        ORGANIZATION IS LINE SEQUENTIAL
        ACCESS IS SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD PeopleLab3.
01 PPeopleAttributes.
        02 PNAME PIC X(20).
        02 PDEGREE.
           03 PDEGREETYPE PIC X(4).
           03 PDEGREEYEAR PIC X(4).
        02 PLOAN.
           03 PAMOUNT PIC 9(5)V99.
           03 PPAID1 PIC 9(4)V99.
           03 PPAID2 PIC 9(4)V99.
           03 PPAID3 PIC 9(4)V99.
           03 PPAID4 PIC 9(4)V99.
           03 PTOTALPAID PIC 9(5)V99.
           03 PBALANCE PIC 9(5)V99.
WORKING-STORAGE SECTION.
01 SPeopleA.
        02 SPNAME PIC X(20).
        02 SDEGREE.
           03 SDEGREETYPE PIC X(4).
           03 SDEGREEYEAR PIC X(4).
        02 SLOAN.
           03 SAMOUNT PIC 9(5)V99.
           03 SPAID1 PIC 9(4)V99.
           03 SPAID2 PIC 9(4)V99.
           03 SPAID3 PIC 9(4)V99.
           03 SPAID4 PIC 9(4)V99.
           03 STOTALPAID PIC 9(5)V99.
           03 SBALANCE PIC 9(5)V99.
        02 SFILLER PIC X(52).
01 FileEnd PIC A(1).

PROCEDURE DIVISION.
DISPLAY "Name"SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES
SPACES SPACES SPACES SPACES"Degree"SPACES SPACES"Year"SPACES SPACES"Loan"SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES"Paid1"
SPACES SPACES SPACES SPACES SPACES SPACES"Paid2"SPACES SPACES SPACES SPACES SPACES SPACES"Paid3"SPACES SPACES SPACES SPACES SPACES SPACES"Paid4"
SPACES SPACES SPACES SPACES SPACES SPACES"Tot Paid" SPACES SPACES SPACES SPACES SPACES "Balance".

DISPLAY SPACES.

OPEN INPUT PeopleLab3.
        
        PERFORM UNTIL FileEnd='Y'
           READ PeopleLab3 INTO SPeopleA
                AT END MOVE 'Y' TO FileEnd
                
                NOT AT END DISPLAY SPNAME SDEGREETYPE SPACES SPACES SPACES SPACES SDEGREEYEAR SPACES SPACES SAMOUNT SPACES SPACES SPACES SPACES SPAID1
                SPACES SPACES SPACES SPACES SPAID2 SPACES SPACES SPACES SPACES SPAID3 SPACES SPACES SPACES SPACES SPAID4 WITH NO ADVANCING
                COMPUTE STOTALPAID = SPAID1 + SPAID2 + SPAID3 + SPAID4
                DISPLAY SPACES SPACES SPACES SPACES STOTALPAID WITH NO ADVANCING
                COMPUTE SBALANCE = SAMOUNT - STOTALPAID
                DISPLAY SPACES SPACES SPACES SPACES SPACES SBALANCE 
                
           END-READ
        END-PERFORM

CLOSE PeopleLab3.
        
STOP RUN.
